ClipboardHistory/published/20241127_ClipboardHistory.org
#+OPTIONS: toc:2 num:10 H:10 author:nil creator:nil timestamp:nil \n:t ^:{}

* COMMENT OPTIONS
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("リスク") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '3-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("人名") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 'isearch prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("入力先にカーソルを当て直す。") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '1-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("貼り付ける。") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '3-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("クリップボードを操作する。") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '9-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("入力先にカーソルを当てる。") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '7-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("^.*\\(?:注意\\).*\\(?:$\\)?") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '2-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("^.*\\(?:必ずしも\\).*\\(?:$\\)?") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '3-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("高橋") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '2-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("国広") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '2-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("斉藤") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '2-my-face prepend)))

# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("齎藤") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '5-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("國廣") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '5-my-face prepend)))
# Hi-lock: ((#[257 "\301\300\305\302\242\306#*\207" [nil t ("髙橋") search-spaces-regexp case-fold-search re-search-forward t] 5 " (fn LIMIT)"] (0 '5-my-face prepend)))

# (setq org-export-with-section-numbers 10)
# (setq org-export-headline-levels 10)
# (setq org-export-with-sub-superscripts nil)
# (setq org-export-preserve-breaks t)
# (setq org-html-validation-link nil)

# ##### オプションの説明
# ####- 『H:10』
# ####  - 見出しとしてエクスポートされるレベル
# ####    - この番号以降はリストとしてエクスポートされる。
# ####    - 注意: 見出しとしてエクスポートされても、連番が付けられるとは限らない。
# ####      - 見出しとしてエクスポートされることと、目次や見出しの左側に連番が付けられているかどうかは別々に設定される。
# ####      - 番号も付けられるかどうかを司っているのは オプション num（elisp変数 org-export-with-section-numbers）である。
# ####      - ゆえに H と num は同じ値にしておくのが混乱が少なくて良さそう。
# ####  - elisp式による設定
# ####    #+begin_src elisp
# ####    (setq org-export-headline-levels 10)
# ####    #+end_src
# ####- 『num:10』
# ####  - エクスポートされた見出しのどのレベルまで連番を付けるか、あるいや全く付けないか。
# ####    - このレベル以降は、見出しとしてエクスポートされても、連番は付けられない。
# ####    - 注意: 見出しとしてエクスポートされたとしても、目次や見出しの左側に番号が付けられているかどうかは保証されない。
# ####      - 見出しとしてエクスポートされるかどうかを司っているのは オプション H（elisp変数 org-export-headline-levels）である。
# ####      - ゆえに H と num は同じ値にしておくのが混乱が少なくて良さそう。
# ####  - elisp式による設定
# ####    #+begin_src elisp
# ####    (setq org-export-with-section-numbers 10)
# ####    #+end_src
# ####- 『\n:t』
# ####  - orgファイルに記述されている改行がそのままexportされる。
# ####  - elisp式による設定
# ####    #+begin_src elisp
# ####    (setq org-export-preserve-breaks t)
# ####    #+end_src
# ####- 『^:{}』 --> 上付き文字や下付き文字に解釈させるには、波括弧{}で囲む必要がある。
# ####  - elisp式による設定
# ####    #+begin_src elisp
# ####    (setq org-export-with-sub-superscripts nil)
# ####    #+end_src

# (setq org-html-validation-link nil)

# Hi-lock: (("\\[#A\\]" (0 (quote 1-my-face) prepend)))
# Hi-lock: (("\\[#B\\]" (0 (quote 2-my-face) prepend)))
# Hi-lock: (("\\[#C\\]" (0 (quote 3-my-face) prepend)))

# (hayatuyo-org-global-cycle-1)
# (hayatuyo-org-global-cycle-2)
# (hayatuyo-org-global-cycle-3)
# (hayatuyo-org-global-cycle-4)
# (hayatuyo-org-global-cycle-5)

#+link: link-weblio-thesaurus https://thesaurus.weblio.jp/content/%h
#+link: link-weblio-antonym   https://thesaurus.weblio.jp/antonym/content/%h
#+link: link-weblio-meaning   https://www.weblio.jp/content/%h
#+link: link-deepl-jp         https://www.deepl.com/en/translator#ja/en/%h

# 媒体のリスト, facebook, twitter, blog, youtube, amazon-review

* 今日の目指すところ
** 今日、体験していただくこと
- 静的定型句
- 動的定型句
- クリップボード履歴からのFIFOペースト
- 定型句 と launcher との組み合わせ
** 今日、知っていただく（学べる）こと; マインドのブラッシュアップ
- 複利的効果
- 怠惰な心理を克服する戦術

* 今日の話の位置付け
** 地政学の7階層

1. 世界観
2. 政策
3. 大戦略
4. 軍事戦略
5. 作戦
6. 戦術
7. 技術
   - 戦闘に勝つためのどのように技術を使うか？
     - ツールやテクニックの獲得
     - 敵兵の殺し方
     - などなど

戦略の階層を個人向けに修正 : 地政学を英国で学んだ
https://geopoli.exblog.jp/19661333/

** なぜ道具を使うのか？
- 一般論
  - 正確
  - 早い
  - 楽（ラク）
- 特に、文字入力における定型句ツールを使う意義
  - 正確 =  ◎
  - 早い =  ○ときには△
  - 楽（ラク） =  ○ときには△
*** 正確だから道具を使う

みなさんは、こんな間違えやトラブル、お悩みの経験、ありませんでしょうか？

**** 日付と曜日の組み合わせの不一致
- 正誤
  - 正; xx/10（金）
  - 誤; xx/10（木）
- 影響
  - ∴メールの再送信
  - ∴予定の認識のズレ
    - ＜日付側＞xx/10（木）
    - ＜曜日側＞xx/11（金）
  - ∴再アポイントメント
    - ∴失注！？
**** 人名の漢字
- 例
  - 高橋、髙橋
  - 国広、國廣
  - 斉藤、斎藤、齎藤
    - 斉: 整える。等しい。同じ。「斉唱」
    - 斎（齋）: 心身を清める。慎む。祈祷する。「斎潔」
    - 齎: もたらす、贈る（はなむけ）、与える、渡す
- 影響
  - ∴（相手の）不満、ストレス
    - ∴情報の滞り（表面に出ない）や諍い（表面に顕現）
      - ∴プロジェクトの失敗、友情の決裂
**** 西暦と元号の変換
- 昭和: 西暦 - 1925
- 平成: 西暦 - 1988
- 令和: 西暦 - 2018
**** typo（打ち損じ）や「てにをは」（間違い、あるいは修正漏れ）
- 同音異義語
- 文章を推敲したが、助詞が変更されずに、下のまま残されてしまう、など。
  - 推敲前
    - 今日の午後は汐留オフィスに行き、そのまま直帰する予定です。
  - 推敲後（修正漏れ）
    - 今日【の】18時まで汐留オフィス【に】勤務し、19時から【直帰】する予定です。
- 影響
  - （自分の）評価が下がる。
    - 「漢字も書けないなんて！」
    - 「『てにをは』もちゃんと使えないなんて！」
    - 「間違ったままの文章を送ってくるなんて、失礼！」
***** ■寄り道: 誰も指摘してくれない。
- 指摘してくれるのは、親ぐらい。
- 間違いの指摘は失礼、非倫理的（？）
***** ■寄り道: 拙速の文化？
- 同音異義語や「てにをは」の間違いを修正するほうが野暮・「ダサい」（？）
- 間違いの指摘は失礼、非倫理的（？）
**** うろ覚え・勘違い
- 影響
  - ∴コミュニケーションの行き違い、認識違い
    - ∴設計ミス・「出戻り」
      - ∴プロジェクトの失敗
  - ∴（相手の）不満、ストレス
    - ∴情報の滞り（恣意的な情報隠蔽。表面に出ない、水面下。）や諍い（表面に顕現）
      - ∴プロジェクトの失敗、友情の決裂
**** 打つのが面倒に感じる
- 影響
  - ∴低い集中力
    - ∴間違いの誘発
  - ∴省略語の乱用
    - ∴コミュニケーションの行き違い、認識違い
      - ∴設計ミス・「出戻り」
        - ∴プロジェクトの失敗
    - 省略語の例
      - FSI? AWS? NHK? MSF? MAGA? KU会?
        - MSF; Medecins Sans Frontieres「国境なき医師団」
        - MAGA; Make America Great Again!
        - KU会; 大学の登山サークル「渓友会」
