ClipboardHistory/published/20241127_ClipboardHistory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org796beb4">1. 今日の目指すところ</a>
<ul>
<li><a href="#org6415ad3">1.1. 今日、体験していただくこと</a></li>
<li><a href="#org6c5f52f">1.2. 今日、知っていただく（学べる）こと; マインドのブラッシュアップ</a></li>
</ul>
</li>
<li><a href="#org4773309">2. 今日の話の位置付け</a>
<ul>
<li><a href="#org64f9cba">2.1. 地政学の7階層</a></li>
<li><a href="#org61b299e">2.2. なぜ道具を使うのか？</a></li>
<li><a href="#org709f4ff">2.3. ■寄り道: LLMが発達した現在でも定型句ツールを使う意義はあるのか？</a></li>
</ul>
</li>
<li><a href="#org1f82c4c">3. 今日の本題; 定型句管理ツールの活用</a>
<ul>
<li><a href="#orgc8425bf">3.1. 文字入力の高速化方法、あれこれ</a></li>
<li><a href="#orgd73a06e">3.2. 定型句とは？</a></li>
<li><a href="#org010eae4">3.3. 定型句管理ツール「ClipboardHistory」のススメ</a></li>
<li><a href="#orgc8b75d8">3.4. 実践</a></li>
<li><a href="#orgb72beb2">3.5. 使用上の注意</a></li>
<li><a href="#org981a3bb">3.6. 活用のためのアイディア</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org796beb4" class="outline-2">
<h2 id="org796beb4"><span class="section-number-2">1.</span> 今日の目指すところ</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6415ad3" class="outline-3">
<h3 id="org6415ad3"><span class="section-number-3">1.1.</span> 今日、体験していただくこと</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>静的定型句<br /></li>
<li>動的定型句<br /></li>
<li>クリップボード履歴からのFIFOペースト<br /></li>
<li>定型句 と launcher との組み合わせ<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org6c5f52f" class="outline-3">
<h3 id="org6c5f52f"><span class="section-number-3">1.2.</span> 今日、知っていただく（学べる）こと; マインドのブラッシュアップ</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>複利的効果<br /></li>
<li>怠惰な心理を克服する戦術<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4773309" class="outline-2">
<h2 id="org4773309"><span class="section-number-2">2.</span> 今日の話の位置付け</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org64f9cba" class="outline-3">
<h3 id="org64f9cba"><span class="section-number-3">2.1.</span> 地政学の7階層</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>世界観<br /></li>
<li>政策<br /></li>
<li>大戦略<br /></li>
<li>軍事戦略<br /></li>
<li>作戦<br /></li>
<li>戦術<br /></li>
<li>技術<br />
<ul class="org-ul">
<li>戦闘に勝つためのどのように技術を使うか？<br />
<ul class="org-ul">
<li>ツールやテクニックの獲得<br /></li>
<li>敵兵の殺し方<br /></li>
<li>などなど<br /></li>
</ul></li>
</ul></li>
</ol>

<p>
戦略の階層を個人向けに修正 : 地政学を英国で学んだ<br />
<a href="https://geopoli.exblog.jp/19661333/">https://geopoli.exblog.jp/19661333/</a><br />
</p>
</div>
</div>
<div id="outline-container-org61b299e" class="outline-3">
<h3 id="org61b299e"><span class="section-number-3">2.2.</span> なぜ道具を使うのか？</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>一般論<br />
<ul class="org-ul">
<li>正確<br /></li>
<li>早い<br /></li>
<li>楽（ラク）<br /></li>
</ul></li>
<li>特に、文字入力における定型句ツールを使う意義<br />
<ul class="org-ul">
<li>正確 =  ◎<br /></li>
<li>早い =  ○ときには△<br /></li>
<li>楽（ラク） =  ○ときには△<br /></li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgce95483" class="outline-4">
<h4 id="orgce95483"><span class="section-number-4">2.2.1.</span> 正確だから道具を使う</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
みなさんは、こんな間違えやトラブル、お悩みの経験、ありませんでしょうか？<br />
</p>
</div>
<div id="outline-container-org02cbbd5" class="outline-5">
<h5 id="org02cbbd5"><span class="section-number-5">2.2.1.1.</span> 日付と曜日の組み合わせの不一致</h5>
<div class="outline-text-5" id="text-2-2-1-1">
<ul class="org-ul">
<li>正誤<br />
<ul class="org-ul">
<li>正; xx/10（金）<br /></li>
<li>誤; xx/10（木）<br /></li>
</ul></li>
<li>影響<br />
<ul class="org-ul">
<li>∴メールの再送信<br /></li>
<li>∴予定の認識のズレ<br />
<ul class="org-ul">
<li>＜日付側＞xx/10（木）<br /></li>
<li>＜曜日側＞xx/11（金）<br /></li>
</ul></li>
<li>∴再アポイントメント<br />
<ul class="org-ul">
<li>∴失注！？<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6655d61" class="outline-5">
<h5 id="org6655d61"><span class="section-number-5">2.2.1.2.</span> 人名の漢字</h5>
<div class="outline-text-5" id="text-2-2-1-2">
<ul class="org-ul">
<li>例<br />
<ul class="org-ul">
<li>高橋、髙橋<br /></li>
<li>国広、國廣<br /></li>
<li>斉藤、斎藤、齎藤<br />
<ul class="org-ul">
<li>斉: 整える。等しい。同じ。「斉唱」<br /></li>
<li>斎（齋）: 心身を清める。慎む。祈祷する。「斎潔」<br /></li>
<li>齎: もたらす、贈る（はなむけ）、与える、渡す<br /></li>
</ul></li>
</ul></li>
<li>影響<br />
<ul class="org-ul">
<li>∴（相手の）不満、ストレス<br />
<ul class="org-ul">
<li>∴情報の滞り（表面に出ない）や諍い（表面に顕現）<br />
<ul class="org-ul">
<li>∴プロジェクトの失敗、友情の決裂<br /></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgad5486e" class="outline-5">
<h5 id="orgad5486e"><span class="section-number-5">2.2.1.3.</span> 西暦と元号の変換</h5>
<div class="outline-text-5" id="text-2-2-1-3">
<ul class="org-ul">
<li>昭和: 西暦 - 1925<br /></li>
<li>平成: 西暦 - 1988<br /></li>
<li>令和: 西暦 - 2018<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org3db4c5e" class="outline-5">
<h5 id="org3db4c5e"><span class="section-number-5">2.2.1.4.</span> typo（打ち損じ）や「てにをは」（間違い、あるいは修正漏れ）</h5>
<div class="outline-text-5" id="text-2-2-1-4">
<ul class="org-ul">
<li>同音異義語<br /></li>
<li>文章を推敲したが、助詞が変更されずに、下のまま残されてしまう、など。<br />
<ul class="org-ul">
<li>推敲前<br />
<ul class="org-ul">
<li>今日の午後は汐留オフィスに行き、そのまま直帰する予定です。<br /></li>
</ul></li>
<li>推敲後（修正漏れ）<br />
<ul class="org-ul">
<li>今日【の】18時まで汐留オフィス【に】勤務し、19時から【直帰】する予定です。<br /></li>
</ul></li>
</ul></li>
<li>影響<br />
<ul class="org-ul">
<li>（自分の）評価が下がる。<br />
<ul class="org-ul">
<li>「漢字も書けないなんて！」<br /></li>
<li>「『てにをは』もちゃんと使えないなんて！」<br /></li>
<li>「間違ったままの文章を送ってくるなんて、失礼！」<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgafe2f29" class="outline-6">
<h6 id="orgafe2f29"><span class="section-number-6">2.2.1.4.1.</span> ■寄り道: 誰も指摘してくれない。</h6>
<div class="outline-text-6" id="text-2-2-1-4-1">
<ul class="org-ul">
<li>指摘してくれるのは、親ぐらい。<br /></li>
<li>間違いの指摘は失礼、非倫理的（？）<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga1377e1" class="outline-6">
<h6 id="orga1377e1"><span class="section-number-6">2.2.1.4.2.</span> ■寄り道: 拙速の文化？</h6>
<div class="outline-text-6" id="text-2-2-1-4-2">
<ul class="org-ul">
<li>同音異義語や「てにをは」の間違いを修正するほうが野暮・「ダサい」（？）<br /></li>
<li>間違いの指摘は失礼、非倫理的（？）<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0f71fbb" class="outline-5">
<h5 id="org0f71fbb"><span class="section-number-5">2.2.1.5.</span> うろ覚え・勘違い</h5>
<div class="outline-text-5" id="text-2-2-1-5">
<ul class="org-ul">
<li>影響<br />
<ul class="org-ul">
<li>∴コミュニケーションの行き違い、認識違い<br />
<ul class="org-ul">
<li>∴設計ミス・「出戻り」<br />
<ul class="org-ul">
<li>∴プロジェクトの失敗<br /></li>
</ul></li>
</ul></li>
<li>∴（相手の）不満、ストレス<br />
<ul class="org-ul">
<li>∴情報の滞り（恣意的な情報隠蔽。表面に出ない、水面下。）や諍い（表面に顕現）<br />
<ul class="org-ul">
<li>∴プロジェクトの失敗、友情の決裂<br /></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4dee598" class="outline-5">
<h5 id="org4dee598"><span class="section-number-5">2.2.1.6.</span> 打つのが面倒に感じる</h5>
<div class="outline-text-5" id="text-2-2-1-6">
<ul class="org-ul">
<li>影響<br />
<ul class="org-ul">
<li>∴低い集中力<br />
<ul class="org-ul">
<li>∴間違いの誘発<br /></li>
</ul></li>
<li>∴省略語の乱用<br />
<ul class="org-ul">
<li>∴コミュニケーションの行き違い、認識違い<br />
<ul class="org-ul">
<li>∴設計ミス・「出戻り」<br />
<ul class="org-ul">
<li>∴プロジェクトの失敗<br /></li>
</ul></li>
</ul></li>
<li>省略語の例<br />
<ul class="org-ul">
<li>FSI? AWS? NHK? MSF? MAGA? KU会?<br />
<ul class="org-ul">
<li>MSF; Medecins Sans Frontieres「国境なき医師団」<br /></li>
<li>MAGA; Make America Great Again!<br /></li>
<li>KU会; 大学の登山サークル「渓友会」<br /></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
