ClipboardHistory/published/20241127_ClipboardHistory.org
*** 早いから？ 楽だから？
- 注意: 道具の使用は not 目的 but 手段
- 文字入力においては、必ずしも早くないかもしれない。
  - 概ね多くの場合は、道具を使うと早くなるはず。
  - しかし、正確さのために、早さを妥協することもある。
    - 例; 前述の人名とか
- 文字入力においては、必ずしも楽ではないかもしれない。
  - 概ね多くの場合は、道具を使うと楽になるはず。
  - しかし、正確さのために、楽さを妥協することもある、かも！
    - ＜例を思い付くきませんでした＞
*** COMMENT 楽だから; カプセル化・自動化
- 頭（脳）
  - 平仮名やアルファベットを入力する労力
    - 文字数が長くなるほど、間違いも増える（「正確だから」と重なる）
    - そもそも論
      - 確かに、「身体操作に習熟するほど、脳を使わなくなる」らしい。
      - しかし、そもそも習熟する必要性無しで済ませられれば、それでいいじゃん。
        - 千切りキャベツ → 回転マシーンで済む。
        - うなぎ「串打ち3年、裂き8年、焼き一生」 → 料理屋に行けば済む。
        - 飛行機の運転 → パイロットを雇う。
          - パイロットですら、離着陸以外の巡航中は、自動運転を使っている。
- 身体
  - （Clipboard Historyならば）指一本で操作できる
    - （反論: そもそもキーボードを一本指で打つ人がいるので、強くは主張できない。）
*** COMMENT 早いから？
- 必ずしも早くない。
- 正確さのために、早さを妥協することもある。
** ■寄り道: LLMが発達した現在でも定型句ツールを使う意義はあるのか？
*** 情報革命（インターネット）と知能革命（人工知能、深層学習）
1. 農業革命
2. 産業革命
3. 情報革命と知能革命
**** 消えた職業、消える職業
- 文字起こし（音声 → 文章）
- 翻訳・通訳
- イラストレイター（画家、挿絵画家）
- ライター（文筆家）
- 映像
- 脚本
- 経営！？
- 政治！？
- プログラマー！？
- プロジェクトマネージャー！？
- ...
「そして誰もいなくなった」
***** 課題図書
- アフターデジタル
- 世界のエリートはなぜ「美意識」を鍛えるのか? 経営における「アート」と「サイエンス」
- 成田悠輔, 2022, 22世紀の民主主義 選挙はアルゴリズムになり、政治家はネコになる
**** 入力方式の進化
AI（人工知能、深層学習（機械学習））によって可能になった（近い将来、可能になる）入力方式

- 音声認識（スマフォに完備）＜既存＞
  - 要約も！
- 視線入力（ポインティングデバイスとして）＜近い将来 or ある？ 特殊なハードウェアが必要？＞
- 脳波入力（チンパンジーで成功済み）＜近い将来＞

**** 疑問「そもそも論」

音声入力（や脳波入力）が発達すれば、キーボード入力の高速化以前の問題として、そもそもキーボード入力は不要になるのでは？

| 欲しい能力                             | そもそも論                             |
|----------------------------------------+----------------------------------------|
| 千切りキャベツ                         | スライサーとか回転するマシーンで済む。 |
| うなぎ「串打ち3年、裂き8年、焼き一生」 | 料理屋に行けば済む。                   |
| 飛行機の運転                           | パイロットを雇う。                     |
| 高速キーボード入力                     | ????                                   |

*** 2024年の「落とし所」
- 人工知能（深層学習）はシンギュラリティに既に到達しているかもしれない。
- しかし、人工知能お金を生む分野から発達している。
  - 画像認識・画像生成・映像生成...
  - 「新しい技術は戦争と性産業から」
  - 文字入力？
    - それが早くなっても、それ自体はお金を産まない。
    - みんなソコソコ早いから、不便を感じていない？ 需要がない？
- ただし、プログラミングは既に人工知能（深層学習）を使う時代。
  - 特殊な用途
**** 結論
- 2024年11月 :: 日常の文章における定型句（スニペット）やコピペの履歴の活用にまだ「歩がある」。
- 202X年XX月 :: 脳波入力普及率94%
**** 課題図書
- イノベーションのジレンマ


* 今日の本題; 定型句管理ツールの活用
** 文字入力の高速化方法、あれこれ
種々の文字入力を高速化する方法が IME から提供されています。
*** IME
- 日本語入力プログラム
- （Japanese） Input Method Editor
*** 文字入力を高速化する方法
- 短縮読み
  - 「おつはや」→「お疲れさまです。早川です。」
  - 「いかとお」→「以下の通りです。」
- 一発アルファベット変換（F10キー）
  - 日本語入力（IMEをON）のままでも、アルファベットを入力できる。
- 一発カタカナ変換（ctrl-i）
- 一発ひらがな変換（ctrl-u）
  - 予想される反論: 別にエンターキーを押せば済むのでは？
  - → エンターキーを押してしまうと、変換が確定してしまうので、推敲できない。
- 確定後の再変換
  - 漢字の変換ミス

*** しかし、IMEのもどかしさよ
自分が入力したい言葉は頭の中で確定している。
しかし、PCに対する操作がもどかしい。

**** PCに対する操作
1. 平仮名をPCに入力する。
   - 平仮名の入力を間違えるもどかしさ
2. 漢字を候補の中から選択する。
   - 候補の選択を間違えるもどかしさ
     - 復旧方法「変換キー」; 買える <--> 帰る <--> 変える

*** 対策: IMEのもどかしさを低減するために...
平仮名入力や漢字変換を減らし、
代わりに定型句を活用しよう！

** 定型句とは？

定型句には「静的定型句」と「動的定型句」がある。

- 静的定型句（いわゆる定型句）
  - 一言一句まで完全に決まり切った文字列
    - 「寿限無 寿限無 五劫のすり切れ 海砂利水魚の 水行末、雲来末、風来末 食う寝るところに住むところ やぶらこうじのぶらこうじ パイポパイポパイポのシューリンガン シューリンガンのグーリンダイ グーリンダイのポンポコピーのポンポコナーの長久命の長助」
    - 「お疲れ様です。NET 6G（NI）の早川です。」
- 動的定型句
  - 一定の規則の下、与えられる引数（パラメータ）や状況に応じて変わる文字列
    - 日時
      - 20241124-005343
      - ↓3秒後
      - 20241124-005346
** 定型句管理ツール「ClipboardHistory」のススメ

*** 実演（披露）

