ClipboardHistory/published/20241127_ClipboardHistory.html
<div id="outline-container-org6791166" class="outline-4">
<h4 id="org6791166"><span class="section-number-4">2.2.2.</span> 早いから？ 楽だから？</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>注意: 道具の使用は not 目的 but 手段<br /></li>
<li>文字入力においては、必ずしも早くないかもしれない。<br />
<ul class="org-ul">
<li>概ね多くの場合は、道具を使うと早くなるはず。<br /></li>
<li>しかし、正確さのために、早さを妥協することもある。<br />
<ul class="org-ul">
<li>例; 前述の人名とか<br /></li>
</ul></li>
</ul></li>
<li>文字入力においては、必ずしも楽ではないかもしれない。<br />
<ul class="org-ul">
<li>概ね多くの場合は、道具を使うと楽になるはず。<br /></li>
<li>しかし、正確さのために、楽さを妥協することもある、かも！<br />
<ul class="org-ul">
<li>＜例を思い付くきませんでした＞<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org709f4ff" class="outline-3">
<h3 id="org709f4ff"><span class="section-number-3">2.3.</span> ■寄り道: LLMが発達した現在でも定型句ツールを使う意義はあるのか？</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orga5ed29f" class="outline-4">
<h4 id="orga5ed29f"><span class="section-number-4">2.3.1.</span> 情報革命（インターネット）と知能革命（人工知能、深層学習）</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>農業革命<br /></li>
<li>産業革命<br /></li>
<li>情報革命と知能革命<br /></li>
</ol>
</div>
<div id="outline-container-org14fbf39" class="outline-5">
<h5 id="org14fbf39"><span class="section-number-5">2.3.1.1.</span> 消えた職業、消える職業</h5>
<div class="outline-text-5" id="text-2-3-1-1">
<ul class="org-ul">
<li>文字起こし（音声 → 文章）<br /></li>
<li>翻訳・通訳<br /></li>
<li>イラストレイター（画家、挿絵画家）<br /></li>
<li>ライター（文筆家）<br /></li>
<li>映像<br /></li>
<li>脚本<br /></li>
<li>経営！？<br /></li>
<li>政治！？<br /></li>
<li>プログラマー！？<br /></li>
<li>プロジェクトマネージャー！？<br /></li>
<li>&#x2026;<br /></li>
</ul>
<p>
「そして誰もいなくなった」<br />
</p>
</div>
<div id="outline-container-org7c978c6" class="outline-6">
<h6 id="org7c978c6"><span class="section-number-6">2.3.1.1.1.</span> 課題図書</h6>
<div class="outline-text-6" id="text-2-3-1-1-1">
<ul class="org-ul">
<li>アフターデジタル<br /></li>
<li>世界のエリートはなぜ「美意識」を鍛えるのか? 経営における「アート」と「サイエンス」<br /></li>
<li>成田悠輔, 2022, 22世紀の民主主義 選挙はアルゴリズムになり、政治家はネコになる<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org452e4eb" class="outline-5">
<h5 id="org452e4eb"><span class="section-number-5">2.3.1.2.</span> 入力方式の進化</h5>
<div class="outline-text-5" id="text-2-3-1-2">
<p>
AI（人工知能、深層学習（機械学習））によって可能になった（近い将来、可能になる）入力方式<br />
</p>

<ul class="org-ul">
<li>音声認識（スマフォに完備）＜既存＞<br />
<ul class="org-ul">
<li>要約も！<br /></li>
</ul></li>
<li>視線入力（ポインティングデバイスとして）＜近い将来 or ある？ 特殊なハードウェアが必要？＞<br /></li>
<li>脳波入力（チンパンジーで成功済み）＜近い将来＞<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf891705" class="outline-5">
<h5 id="orgf891705"><span class="section-number-5">2.3.1.3.</span> 疑問「そもそも論」</h5>
<div class="outline-text-5" id="text-2-3-1-3">
<p>
音声入力（や脳波入力）が発達すれば、キーボード入力の高速化以前の問題として、そもそもキーボード入力は不要になるのでは？<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">欲しい能力</th>
<th scope="col" class="org-left">そもそも論</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">千切りキャベツ</td>
<td class="org-left">スライサーとか回転するマシーンで済む。</td>
</tr>

<tr>
<td class="org-left">うなぎ「串打ち3年、裂き8年、焼き一生」</td>
<td class="org-left">料理屋に行けば済む。</td>
</tr>

<tr>
<td class="org-left">飛行機の運転</td>
<td class="org-left">パイロットを雇う。</td>
</tr>

<tr>
<td class="org-left">高速キーボード入力</td>
<td class="org-left">????</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org5fe2b3f" class="outline-4">
<h4 id="org5fe2b3f"><span class="section-number-4">2.3.2.</span> 2024年の「落とし所」</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>人工知能（深層学習）はシンギュラリティに既に到達しているかもしれない。<br /></li>
<li>しかし、人工知能お金を生む分野から発達している。<br />
<ul class="org-ul">
<li>画像認識・画像生成・映像生成&#x2026;<br /></li>
<li>「新しい技術は戦争と性産業から」<br /></li>
<li>文字入力？<br />
<ul class="org-ul">
<li>それが早くなっても、それ自体はお金を産まない。<br /></li>
<li>みんなソコソコ早いから、不便を感じていない？ 需要がない？<br /></li>
</ul></li>
</ul></li>
<li>ただし、プログラミングは既に人工知能（深層学習）を使う時代。<br />
<ul class="org-ul">
<li>特殊な用途<br /></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org1181bc6" class="outline-5">
<h5 id="org1181bc6"><span class="section-number-5">2.3.2.1.</span> 結論</h5>
<div class="outline-text-5" id="text-2-3-2-1">
<dl class="org-dl">
<dt>2024年11月</dt><dd>日常の文章における定型句（スニペット）やコピペの履歴の活用にまだ「歩がある」。<br /></dd>
<dt>202X年XX月</dt><dd>脳波入力普及率94%<br /></dd>
</dl>
</div>
</div>
<div id="outline-container-org68d3e25" class="outline-5">
<h5 id="org68d3e25"><span class="section-number-5">2.3.2.2.</span> 課題図書</h5>
<div class="outline-text-5" id="text-2-3-2-2">
<ul class="org-ul">
<li>イノベーションのジレンマ<br /></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org1f82c4c" class="outline-2">
<h2 id="org1f82c4c"><span class="section-number-2">3.</span> 今日の本題; 定型句管理ツールの活用</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc8425bf" class="outline-3">
<h3 id="orgc8425bf"><span class="section-number-3">3.1.</span> 文字入力の高速化方法、あれこれ</h3>
<div class="outline-text-3" id="text-3-1">
<p>
種々の文字入力を高速化する方法が IME から提供されています。<br />
</p>
</div>
<div id="outline-container-org13565bc" class="outline-4">
<h4 id="org13565bc"><span class="section-number-4">3.1.1.</span> IME</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>日本語入力プログラム<br /></li>
<li>（Japanese） Input Method Editor<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org94aa231" class="outline-4">
<h4 id="org94aa231"><span class="section-number-4">3.1.2.</span> 文字入力を高速化する方法</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>短縮読み<br />
<ul class="org-ul">
<li>「おつはや」→「お疲れさまです。早川です。」<br /></li>
<li>「いかとお」→「以下の通りです。」<br /></li>
</ul></li>
<li>一発アルファベット変換（F10キー）<br />
<ul class="org-ul">
<li>日本語入力（IMEをON）のままでも、アルファベットを入力できる。<br /></li>
</ul></li>
<li>一発カタカナ変換（ctrl-i）<br /></li>
<li>一発ひらがな変換（ctrl-u）<br />
<ul class="org-ul">
<li>予想される反論: 別にエンターキーを押せば済むのでは？<br /></li>
<li>→ エンターキーを押してしまうと、変換が確定してしまうので、推敲できない。<br /></li>
</ul></li>
<li>確定後の再変換<br />
<ul class="org-ul">
<li>漢字の変換ミス<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd1e462c" class="outline-4">
<h4 id="orgd1e462c"><span class="section-number-4">3.1.3.</span> しかし、IMEのもどかしさよ</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
自分が入力したい言葉は頭の中で確定している。<br />
しかし、PCに対する操作がもどかしい。<br />
</p>
</div>
<div id="outline-container-org955a578" class="outline-5">
<h5 id="org955a578"><span class="section-number-5">3.1.3.1.</span> PCに対する操作</h5>
<div class="outline-text-5" id="text-3-1-3-1">
<ol class="org-ol">
<li>平仮名をPCに入力する。<br />
<ul class="org-ul">
<li>平仮名の入力を間違えるもどかしさ<br /></li>
</ul></li>
<li>漢字を候補の中から選択する。<br />
<ul class="org-ul">
<li>候補の選択を間違えるもどかしさ<br />
<ul class="org-ul">
<li>復旧方法「変換キー」; 買える &lt;&#x2013;&gt; 帰る &lt;&#x2013;&gt; 変える<br /></li>
</ul></li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga6c8849" class="outline-4">
<h4 id="orga6c8849"><span class="section-number-4">3.1.4.</span> 対策: IMEのもどかしさを低減するために&#x2026;</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
平仮名入力や漢字変換を減らし、<br />
代わりに定型句を活用しよう！<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgd73a06e" class="outline-3">
<h3 id="orgd73a06e"><span class="section-number-3">3.2.</span> 定型句とは？</h3>
<div class="outline-text-3" id="text-3-2">
<p>
定型句には「静的定型句」と「動的定型句」がある。<br />
</p>

<ul class="org-ul">
<li>静的定型句（いわゆる定型句）<br />
<ul class="org-ul">
<li>一言一句まで完全に決まり切った文字列<br />
<ul class="org-ul">
<li>「寿限無 寿限無 五劫のすり切れ 海砂利水魚の 水行末、雲来末、風来末 食う寝るところに住むところ やぶらこうじのぶらこうじ パイポパイポパイポのシューリンガン シューリンガンのグーリンダイ グーリンダイのポンポコピーのポンポコナーの長久命の長助」<br /></li>
<li>「お疲れ様です。NET 6G（NI）の早川です。」<br /></li>
</ul></li>
</ul></li>
<li>動的定型句<br />
<ul class="org-ul">
<li>一定の規則の下、与えられる引数（パラメータ）や状況に応じて変わる文字列<br />
<ul class="org-ul">
<li>日時<br />
<ul class="org-ul">
<li>20241124-005343<br /></li>
<li>↓3秒後<br /></li>
<li>20241124-005346<br /></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org010eae4" class="outline-3">
<h3 id="org010eae4"><span class="section-number-3">3.3.</span> 定型句管理ツール「ClipboardHistory」のススメ</h3>
<div class="outline-text-3" id="text-3-3">
</div>
