ClipboardHistory/published/20241127_ClipboardHistory.org
*** 定型句ツール「ClipboardHistory」の長所
- 階層化できる。
  - どこに何があるのかすら覚えなくてもいい。
  - 段階的に絞り込んでいけばいい。
- 「アクセスキー」（[[■寄り道; アクセスキー][後述]]）を設定できる。
  - 階層を深堀りするときの操作を、マウスやカーソルキー以外にも、キーボードでも行える。
    - 手がキーボードのホームポジションから離れず、高速な操作を可能とする。
- 設定ファイルがテキストである
  - 読める。人間が読んで、そのまま理解できる。
  - 変更点（差分）を確認できる。
  - ファイルが小さい、軽い。
- *FIFO* と *LILO* で、貼り付け順序を制御できる。
  - ＜後ほど実践していただきます＞
- メニュー構成を好みで変えられる。
  - 定型句用メニュー
  - 履歴用メニュー
- ランチャーにもなる。
  - 実態は cmdの"start"コマンド ？
  | 定型句の意味                   | 起動するもの     |
  |--------------------------------+------------------|
  | URL                            | WEBブラウザ      |
  | パス（末尾がバックスラッシュ） | エクスプローラー |
  | パス（末尾が".xlsx"）          | エクセル         |
  | パス（末尾が".js"）            | VsCode           |
  - ※もちろん、ランチャー機能を使わずに、クリップボードに貼り付けるだけの操作もできる。
- クリップボード（キャッシュ）内の文字列を編集できる。
  - 例1: 括弧で括る。
  - 例2: 引用符の記号「>」を付ける
  - 例3: 引用符の記号「>」を外す。
- 『後付け』もできる。
  - 「PAP対応」(Pop up in Application Process、造語？)
  - 「後付け」ができない場合: カーソルの当て直しが必要
    1. 入力先にカーソルを当てる。
    2. クリップボードを操作する。
       - クリップボードの操作後、いざ貼り付けようとしたら、カーソルが外れてしまっている！
    3. 入力先にカーソルを当て直す。
    4. 貼り付ける。
  - 「後付け」ができる場合:「後付け」でも「先付け」でも、どちらも操作できる。
    - 「後付け」の場合
      1. 入力先にカーソルを当てる。
      2. クリップボードを操作する。
         - カーソルが入力先から外れていない（戻る）
      3. 貼り付ける。
    - 「先付け」の場合
      1. クリップボードを操作する。
      2. 入力先にカーソルを当てる。
      3. 貼り付ける。
- 作っているのが日本人である。
- 細かな使い勝手が良い。

**** ■寄り道; アクセスキー
実はショートカットキーには2種類ある！

- ホットキー
- アクセスキー

***** 「ホットキー」
- いわゆるショートカットキー
- 紐付いているモノ
  - ある瞬間に同時に押されるキーの組み合わせ
  - 呼び出される機能
- ＜空間的＞
  - 空間に依存する = 同時に押されるキーの空間配置に依存する。
  - 時間に依存しない
    - 「同時に押される」＝「瞬間的に押される」＝時間の前後関係がない。
- 具体例
  | ctrl-c | コピー   |
  | ctrl-v | ペースト |
  | ctrl-p | 印刷     |
***** 「アクセスキー」
- ポップアップするツールバーを目で見ながら、必要な機能に漸近していく方式
- 紐付いているモノ
  - キーが押される順番
  - 呼び出される機能
- ＜時間的＞
  - 時間に依存する = キーが押される順番に依存する。
  - （空間に依存しない？）
***** 「アクセスキー」の起動方法
- ALTキーから始める。
  1. まず、ALTキーのみを押して離す。
     - その時（最初は）アルファベットなどは押さない。
  2. 順次アルファベットを押して、機能に漸近していく。
- 具体例
  - （その場で）

*** 定型句ツール「ClipboardHistory」のダウンロードとインストール

Clipboard History 1.9.1 (クリップボード履歴＆定型文) を公開しました - ぶらんくのーと: TOPICS
https://blank-note.sakura.ne.jp/topics/clipboard_history.html

** 実践
- 動的定型句/日時
- FIFO
- LILO
- 括弧で囲む
- 引用符を付ける、外す
- ランチャー
  - URL
  - アプリ
  - エクスプローラー
- 検索
  - 履歴の検索
  - 定型句の検索
- メニュー構成をお好みに変えてみる
** 使用上の注意
*** 使用上の注意 / 保持する履歴の量（エラー抑止）
- 多すぎると、謎のエラーが発生する
  - 【件数】×【1件当たりの最大文字数】
  - 1000 × 1000
- エラー発生後に固まってしまったら、「再読み込み」で復旧しよう。
*** 使用上の注意 / パスワードのコピペ時（情報漏洩防止）
- パスワードは履歴に残さないようにする。
  - 「クリップボード履歴をサスペンド」
** 活用のためのアイディア
*** 活用のためのアイディア / アクセスキーの選択方針
**** 方針
- 頭文字
- 押しやすさ
  - ホームポジション; j,k,f,d,...
  - 一つ前のアクセスキーの近く あるいは 同じ文字
**** 例
    1. d = Datetimeの頭文字「D」
    2. d = Dateの頭文字「D」
    3. d = 2打目と同じ文字「D」
