ClipboardHistory/published/20241127_ClipboardHistory.html
<div id="outline-container-orgf9d7317" class="outline-4">
<h4 id="orgf9d7317"><span class="section-number-4">3.3.1.</span> 実演（披露）</h4>
</div>

<div id="outline-container-orgcb8fea6" class="outline-4">
<h4 id="orgcb8fea6"><span class="section-number-4">3.3.2.</span> 定型句ツール「ClipboardHistory」の長所</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>階層化できる。<br />
<ul class="org-ul">
<li>どこに何があるのかすら覚えなくてもいい。<br /></li>
<li>段階的に絞り込んでいけばいい。<br /></li>
</ul></li>
<li>「アクセスキー」（<a href="#org9b1f196">後述</a>）を設定できる。<br />
<ul class="org-ul">
<li>階層を深堀りするときの操作を、マウスやカーソルキー以外にも、キーボードでも行える。<br />
<ul class="org-ul">
<li>手がキーボードのホームポジションから離れず、高速な操作を可能とする。<br /></li>
</ul></li>
</ul></li>
<li>設定ファイルがテキストである<br />
<ul class="org-ul">
<li>読める。人間が読んで、そのまま理解できる。<br /></li>
<li>変更点（差分）を確認できる。<br /></li>
<li>ファイルが小さい、軽い。<br /></li>
</ul></li>
<li><b>FIFO</b> と <b>LILO</b> で、貼り付け順序を制御できる。<br />
<ul class="org-ul">
<li>＜後ほど実践していただきます＞<br /></li>
</ul></li>
<li>メニュー構成を好みで変えられる。<br />
<ul class="org-ul">
<li>定型句用メニュー<br /></li>
<li>履歴用メニュー<br /></li>
</ul></li>
<li><p>
ランチャーにもなる。<br />
</p>
<ul class="org-ul">
<li>実態は cmdの"start"コマンド ？<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">定型句の意味</th>
<th scope="col" class="org-left">起動するもの</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">URL</td>
<td class="org-left">WEBブラウザ</td>
</tr>

<tr>
<td class="org-left">パス（末尾がバックスラッシュ）</td>
<td class="org-left">エクスプローラー</td>
</tr>

<tr>
<td class="org-left">パス（末尾が".xlsx"）</td>
<td class="org-left">エクセル</td>
</tr>

<tr>
<td class="org-left">パス（末尾が".js"）</td>
<td class="org-left">VsCode</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>※もちろん、ランチャー機能を使わずに、クリップボードに貼り付けるだけの操作もできる。<br /></li>
</ul></li>
<li>クリップボード（キャッシュ）内の文字列を編集できる。<br />
<ul class="org-ul">
<li>例1: 括弧で括る。<br /></li>
<li>例2: 引用符の記号「&gt;」を付ける<br /></li>
<li>例3: 引用符の記号「&gt;」を外す。<br /></li>
</ul></li>
<li>『後付け』もできる。<br />
<ul class="org-ul">
<li>「PAP対応」(Pop up in Application Process、造語？)<br /></li>
<li>「後付け」ができない場合: カーソルの当て直しが必要<br />
<ol class="org-ol">
<li>入力先にカーソルを当てる。<br /></li>
<li>クリップボードを操作する。<br />
<ul class="org-ul">
<li>クリップボードの操作後、いざ貼り付けようとしたら、カーソルが外れてしまっている！<br /></li>
</ul></li>
<li>入力先にカーソルを当て直す。<br /></li>
<li>貼り付ける。<br /></li>
</ol></li>
<li>「後付け」ができる場合:「後付け」でも「先付け」でも、どちらも操作できる。<br />
<ul class="org-ul">
<li>「後付け」の場合<br />
<ol class="org-ol">
<li>入力先にカーソルを当てる。<br /></li>
<li>クリップボードを操作する。<br />
<ul class="org-ul">
<li>カーソルが入力先から外れていない（戻る）<br /></li>
</ul></li>
<li>貼り付ける。<br /></li>
</ol></li>
<li>「先付け」の場合<br />
<ol class="org-ol">
<li>クリップボードを操作する。<br /></li>
<li>入力先にカーソルを当てる。<br /></li>
<li>貼り付ける。<br /></li>
</ol></li>
</ul></li>
</ul></li>
<li>作っているのが日本人である。<br /></li>
<li>細かな使い勝手が良い。<br /></li>
</ul>
</div>
<div id="outline-container-org9b1f196" class="outline-5">
<h5 id="org9b1f196"><span class="section-number-5">3.3.2.1.</span> ■寄り道; アクセスキー</h5>
<div class="outline-text-5" id="text-3-3-2-1">
<p>
実はショートカットキーには2種類ある！<br />
</p>

<ul class="org-ul">
<li>ホットキー<br /></li>
<li>アクセスキー<br /></li>
</ul>
</div>
<div id="outline-container-org80cc3a9" class="outline-6">
<h6 id="org80cc3a9"><span class="section-number-6">3.3.2.1.1.</span> 「ホットキー」</h6>
<div class="outline-text-6" id="text-3-3-2-1-1">
<ul class="org-ul">
<li>いわゆるショートカットキー<br /></li>
<li>紐付いているモノ<br />
<ul class="org-ul">
<li>ある瞬間に同時に押されるキーの組み合わせ<br /></li>
<li>呼び出される機能<br /></li>
</ul></li>
<li>＜空間的＞<br />
<ul class="org-ul">
<li>空間に依存する = 同時に押されるキーの空間配置に依存する。<br /></li>
<li>時間に依存しない<br />
<ul class="org-ul">
<li>「同時に押される」＝「瞬間的に押される」＝時間の前後関係がない。<br /></li>
</ul></li>
</ul></li>
<li><p>
具体例<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">ctrl-c</td>
<td class="org-left">コピー</td>
</tr>

<tr>
<td class="org-left">ctrl-v</td>
<td class="org-left">ペースト</td>
</tr>

<tr>
<td class="org-left">ctrl-p</td>
<td class="org-left">印刷</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
<div id="outline-container-org1a70cc7" class="outline-6">
<h6 id="org1a70cc7"><span class="section-number-6">3.3.2.1.2.</span> 「アクセスキー」</h6>
<div class="outline-text-6" id="text-3-3-2-1-2">
<ul class="org-ul">
<li>ポップアップするツールバーを目で見ながら、必要な機能に漸近していく方式<br /></li>
<li>紐付いているモノ<br />
<ul class="org-ul">
<li>キーが押される順番<br /></li>
<li>呼び出される機能<br /></li>
</ul></li>
<li>＜時間的＞<br />
<ul class="org-ul">
<li>時間に依存する = キーが押される順番に依存する。<br /></li>
<li>（空間に依存しない？）<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6026da3" class="outline-6">
<h6 id="org6026da3"><span class="section-number-6">3.3.2.1.3.</span> 「アクセスキー」の起動方法</h6>
<div class="outline-text-6" id="text-3-3-2-1-3">
<ul class="org-ul">
<li>ALTキーから始める。<br />
<ol class="org-ol">
<li>まず、ALTキーのみを押して離す。<br />
<ul class="org-ul">
<li>その時（最初は）アルファベットなどは押さない。<br /></li>
</ul></li>
<li>順次アルファベットを押して、機能に漸近していく。<br /></li>
</ol></li>
<li>具体例<br />
<ul class="org-ul">
<li>（その場で）<br /></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org2444808" class="outline-4">
<h4 id="org2444808"><span class="section-number-4">3.3.3.</span> 定型句ツール「ClipboardHistory」のダウンロードとインストール</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
Clipboard History 1.9.1 (クリップボード履歴＆定型文) を公開しました - ぶらんくのーと: TOPICS<br />
<a href="https://blank-note.sakura.ne.jp/topics/clipboard_history.html">https://blank-note.sakura.ne.jp/topics/clipboard_history.html</a><br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgc8b75d8" class="outline-3">
<h3 id="orgc8b75d8"><span class="section-number-3">3.4.</span> 実践</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>動的定型句/日時<br /></li>
<li>FIFO<br /></li>
<li>LILO<br /></li>
<li>括弧で囲む<br /></li>
<li>引用符を付ける、外す<br /></li>
<li>ランチャー<br />
<ul class="org-ul">
<li>URL<br /></li>
<li>アプリ<br /></li>
<li>エクスプローラー<br /></li>
</ul></li>
<li>検索<br />
<ul class="org-ul">
<li>履歴の検索<br /></li>
<li>定型句の検索<br /></li>
</ul></li>
<li>メニュー構成をお好みに変えてみる<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgb72beb2" class="outline-3">
<h3 id="orgb72beb2"><span class="section-number-3">3.5.</span> 使用上の注意</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-orgee457c0" class="outline-4">
<h4 id="orgee457c0"><span class="section-number-4">3.5.1.</span> 使用上の注意 / 保持する履歴の量（エラー抑止）</h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li>多すぎると、謎のエラーが発生する<br />
<ul class="org-ul">
<li>【件数】×【1件当たりの最大文字数】<br /></li>
<li>1000 × 1000<br /></li>
</ul></li>
<li>エラー発生後に固まってしまったら、「再読み込み」で復旧しよう。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org716e9ee" class="outline-4">
<h4 id="org716e9ee"><span class="section-number-4">3.5.2.</span> 使用上の注意 / パスワードのコピペ時（情報漏洩防止）</h4>
<div class="outline-text-4" id="text-3-5-2">
<ul class="org-ul">
<li>パスワードは履歴に残さないようにする。<br />
<ul class="org-ul">
<li>「クリップボード履歴をサスペンド」<br /></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org981a3bb" class="outline-3">
<h3 id="org981a3bb"><span class="section-number-3">3.6.</span> 活用のためのアイディア</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-orga648715" class="outline-4">
<h4 id="orga648715"><span class="section-number-4">3.6.1.</span> 活用のためのアイディア / アクセスキーの選択方針</h4>
<div class="outline-text-4" id="text-3-6-1">
</div>
<div id="outline-container-org563f2ee" class="outline-5">
<h5 id="org563f2ee"><span class="section-number-5">3.6.1.1.</span> 方針</h5>
<div class="outline-text-5" id="text-3-6-1-1">
<ul class="org-ul">
<li>頭文字<br /></li>
<li>押しやすさ<br />
<ul class="org-ul">
<li>ホームポジション; j,k,f,d,&#x2026;<br /></li>
<li>一つ前のアクセスキーの近く あるいは 同じ文字<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgdf40f85" class="outline-5">
<h5 id="orgdf40f85"><span class="section-number-5">3.6.1.2.</span> 例</h5>
<div class="outline-text-5" id="text-3-6-1-2">
<ol class="org-ol">
<li>d = Datetimeの頭文字「D」<br /></li>
<li>d = Dateの頭文字「D」<br /></li>
<li>d = 2打目と同じ文字「D」<br /></li>
</ol>
</div>
</div>
</div>
