ClipboardHistory/published/20241127_ClipboardHistory.org
*** 活用のためのアイディア / 貼り付けず、見るだけでもいい
ゼロベース: 必ずしも貼り付ける必要はない。見るだけでもいい。
- 旧暦での月の名（和風月名 わふうげつめい）
    | 旧暦の月 | 和風月名                     | 由来と解説                                                                                                           |
    |----------+------------------------------+----------------------------------------------------------------------------------------------------------------------|
    | 1月      | 睦月（むつき）               | 正月に親類一同が集まる、睦び（親しくする）の月。                                                                     |
    | 2月      | 如月（きさらぎ）             | 衣更着（きさらぎ）とも言う。まだ寒さが残っていて、衣を重ね着する（更に着る）月。                                     |
    | 3月      | 弥生（やよい）               | 木草弥生い茂る（きくさいやおいしげる、草木が生い茂る）月。                                                           |
    | 4月      | 卯月（うづき）               | 卯の花の月。                                                                                                         |
    | 5月      | 皐月（さつき）               | 早月（さつき）とも言う。早苗（さなえ）を植える月。                                                                   |
    | 6月      | 水無月（みなづき、みなつき） | 水の月（「無」は「の」を意味する）で、田に水を引く月の意と言われる。                                                 |
    | 7月      | 文月（ふみづき、ふづき）     | 稲の穂が実る月（穂含月：ほふみづき）                                                                                 |
    | 8月      | 葉月（はづき、はつき）       | 木々の葉落ち月（はおちづき）。                                                                                       |
    | 9月      | 長月（ながつき、ながづき）   | 夜長月（よながづき）。                                                                                               |
    | 10月     | 神無月（かんなづき）         | 神の月（「無」は「の」を意味する）の意味。全国の神々が出雲大社に集まり、各地の神々が留守になる月という説などもある。 |
    | 11月     | 霜月（しもつき）             | 霜の降る月。                                                                                                         |
    | 12月     | 師走（しわす）               | 師匠といえども趨走（すうそう、走り回る）する月。                                                                     |
  - 国立国会図書館, 和風月名（わふうげつめい） | 日本の暦
    - https://www.ndl.go.jp/koyomi/chapter3/s8.html
- 祝日
    | 名称         | 日付     | 備考                       |
    |--------------+----------+----------------------------|
    | 元日         | 1月1日   |                            |
    | 成人の日     | 1月8日   |                            |
    | 建国記念の日 | 2月11日  |                            |
    | 休日         | 2月12日  | 祝日法第3条第2項による休日 |
    | 天皇誕生日   | 2月23日  |                            |
    | 春分の日     | 3月20日  |                            |
    | 昭和の日     | 4月29日  |                            |
    | 憲法記念日   | 5月3日   |                            |
    | みどりの日   | 5月4日   |                            |
    | こどもの日   | 5月5日   |                            |
    | 休日         | 5月6日   | 祝日法第3条第2項による休日 |
    | 海の日       | 7月15日  |                            |
    | 山の日       | 8月11日  |                            |
    | 休日         | 8月12日  | 祝日法第3条第2項による休日 |
    | 敬老の日     | 9月16日  |                            |
    | 秋分の日     | 9月22日  |                            |
    | 休日         | 9月23日  | 祝日法第3条第2項による休日 |
    | スポーツの日 | 10月14日 |                            |
    | 文化の日     | 11月3日  |                            |
    | 休日         | 11月4日  | 祝日法第3条第2項による休日 |
    | 勤労感謝の日 | 11月23日 |                            |
  - 国民の祝日について - 内閣府
    - https://www8.cao.go.jp/chosei/shukujitsu/gaiyou.html
*** 活用のためのアイディア / 最終的には削除されてしまう部分が含まれていても良い
**** 考え方
メールの執筆やチケットの起票などにおいて、
必須の要素を書き漏らさないように、
観点を列挙しておくために定型句を貼り付け、
記述が進むうちに、削除されてしまってもいい。

**** 具体例
- 5W1H
  - Who
  - Where
  - When
  - What
  - Why
  - How
  - How much
- バグの報告（速報）
  - 環境
    - 開発? 検証? 本番?
    - アプリのver（git の commit ID）
  - 発生時刻
  - 発生手順
  - 現象
  - 影響範囲

*** 活用のためのアイディア / まず登録するもの / 汎プロジェクト
- 部署名（詳細）
- 部署名（簡略）
- メールアドレス
- メールの署名
- 電話番号（私物）
- メールアドレス（私物）
- 物品登録番号・バーコード番号・（固定IPアドレス）
- linuxコマンド
  - git系
  - apt系（ubuntu）
  - docker, docker composer, kubernates
  - find と xargs
  - sed や awk
*** 活用のためのアイディア / まず登録するもの / プロジェクト別
- プロジェクトの情報
  - プロジェクトのコードネーム
  - 登録番号（親番号）
  - ファイル名の接頭辞「yyyymmdd_【コードネーム】__」
  - AWSアカウントの情報
    - ログインURL
    - AWSアカウント番号
    - AWSアカウントの別名（エイリアス）
  - Issue Tracking System
    - チケット一覧のURL
    - チケット一覧のURL（未完了のみ）
    - チケット一覧のURL（自分が担当するもののみ）
  - お客様情報
    - 会社名
    - 部署名
    - 住所
    - 電話番号
  - メンバー名
    - 同音異字がある方
    - 同性の方がいる場合
    - 難読の名字の方
    - 外国籍の方（その方が望む、カタカナでの表記）
  - 固有名詞
    - 法律名
    - 制度名
    - 組織名
      - 省庁名、部局名
      - 独立行政法人名
*** 活用のためのアイディア / 日々更新（追加・変更）
- 設計の成果物（設計中でも）
  - データベース名
  - スキーマ名
  - テーブル名
  - 文書名、ファイル名
  - 画面名
- 呼び出すAPIの属性
  - エンドポイント（URL）
  - パス
  - query文字列
  - httpのヘッダーやボディのkey名
  - AWSリソース名
*** 活用のためのアイディア / 日々更新（追加・変更）が面倒？

Q. 面倒！

**** A. 指数の力
道具（定型句）単品ではなく、複数の道具（定型句）を掛け合わせることによる複利的効果
***** 指数とは？
累乗（るいじょう）とも言う。
****** 数式の定義
- 2の3乗 = 2 ** 3 = 2 ^ 3 = 2 * 2 * 2 = 8
- 3の4乗 = 3 ** 4 = 3 ^ 4 = 3 * 3 * 3 * 3 = 81
