ClipboardHistory/published/20241127_ClipboardHistory.html
<div id="outline-container-org03d6921" class="outline-4">
<h4 id="org03d6921"><span class="section-number-4">3.6.2.</span> 活用のためのアイディア / 貼り付けず、見るだけでもいい</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
ゼロベース: 必ずしも貼り付ける必要はない。見るだけでもいい。<br />
</p>
<ul class="org-ul">
<li><p>
旧暦での月の名（和風月名 わふうげつめい）<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">旧暦の月</th>
<th scope="col" class="org-left">和風月名</th>
<th scope="col" class="org-left">由来と解説</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1月</td>
<td class="org-left">睦月（むつき）</td>
<td class="org-left">正月に親類一同が集まる、睦び（親しくする）の月。</td>
</tr>

<tr>
<td class="org-left">2月</td>
<td class="org-left">如月（きさらぎ）</td>
<td class="org-left">衣更着（きさらぎ）とも言う。まだ寒さが残っていて、衣を重ね着する（更に着る）月。</td>
</tr>

<tr>
<td class="org-left">3月</td>
<td class="org-left">弥生（やよい）</td>
<td class="org-left">木草弥生い茂る（きくさいやおいしげる、草木が生い茂る）月。</td>
</tr>

<tr>
<td class="org-left">4月</td>
<td class="org-left">卯月（うづき）</td>
<td class="org-left">卯の花の月。</td>
</tr>

<tr>
<td class="org-left">5月</td>
<td class="org-left">皐月（さつき）</td>
<td class="org-left">早月（さつき）とも言う。早苗（さなえ）を植える月。</td>
</tr>

<tr>
<td class="org-left">6月</td>
<td class="org-left">水無月（みなづき、みなつき）</td>
<td class="org-left">水の月（「無」は「の」を意味する）で、田に水を引く月の意と言われる。</td>
</tr>

<tr>
<td class="org-left">7月</td>
<td class="org-left">文月（ふみづき、ふづき）</td>
<td class="org-left">稲の穂が実る月（穂含月：ほふみづき）</td>
</tr>

<tr>
<td class="org-left">8月</td>
<td class="org-left">葉月（はづき、はつき）</td>
<td class="org-left">木々の葉落ち月（はおちづき）。</td>
</tr>

<tr>
<td class="org-left">9月</td>
<td class="org-left">長月（ながつき、ながづき）</td>
<td class="org-left">夜長月（よながづき）。</td>
</tr>

<tr>
<td class="org-left">10月</td>
<td class="org-left">神無月（かんなづき）</td>
<td class="org-left">神の月（「無」は「の」を意味する）の意味。全国の神々が出雲大社に集まり、各地の神々が留守になる月という説などもある。</td>
</tr>

<tr>
<td class="org-left">11月</td>
<td class="org-left">霜月（しもつき）</td>
<td class="org-left">霜の降る月。</td>
</tr>

<tr>
<td class="org-left">12月</td>
<td class="org-left">師走（しわす）</td>
<td class="org-left">師匠といえども趨走（すうそう、走り回る）する月。</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>国立国会図書館, 和風月名（わふうげつめい） | 日本の暦<br />
<ul class="org-ul">
<li><a href="https://www.ndl.go.jp/koyomi/chapter3/s8.html">https://www.ndl.go.jp/koyomi/chapter3/s8.html</a><br /></li>
</ul></li>
</ul></li>
<li><p>
祝日<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">日付</th>
<th scope="col" class="org-left">備考</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">元日</td>
<td class="org-left">1月1日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">成人の日</td>
<td class="org-left">1月8日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">建国記念の日</td>
<td class="org-left">2月11日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">休日</td>
<td class="org-left">2月12日</td>
<td class="org-left">祝日法第3条第2項による休日</td>
</tr>

<tr>
<td class="org-left">天皇誕生日</td>
<td class="org-left">2月23日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">春分の日</td>
<td class="org-left">3月20日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">昭和の日</td>
<td class="org-left">4月29日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">憲法記念日</td>
<td class="org-left">5月3日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">みどりの日</td>
<td class="org-left">5月4日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">こどもの日</td>
<td class="org-left">5月5日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">休日</td>
<td class="org-left">5月6日</td>
<td class="org-left">祝日法第3条第2項による休日</td>
</tr>

<tr>
<td class="org-left">海の日</td>
<td class="org-left">7月15日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">山の日</td>
<td class="org-left">8月11日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">休日</td>
<td class="org-left">8月12日</td>
<td class="org-left">祝日法第3条第2項による休日</td>
</tr>

<tr>
<td class="org-left">敬老の日</td>
<td class="org-left">9月16日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">秋分の日</td>
<td class="org-left">9月22日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">休日</td>
<td class="org-left">9月23日</td>
<td class="org-left">祝日法第3条第2項による休日</td>
</tr>

<tr>
<td class="org-left">スポーツの日</td>
<td class="org-left">10月14日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">文化の日</td>
<td class="org-left">11月3日</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">休日</td>
<td class="org-left">11月4日</td>
<td class="org-left">祝日法第3条第2項による休日</td>
</tr>

<tr>
<td class="org-left">勤労感謝の日</td>
<td class="org-left">11月23日</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>国民の祝日について - 内閣府<br />
<ul class="org-ul">
<li><a href="https://www8.cao.go.jp/chosei/shukujitsu/gaiyou.html">https://www8.cao.go.jp/chosei/shukujitsu/gaiyou.html</a><br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfb629bd" class="outline-4">
<h4 id="orgfb629bd"><span class="section-number-4">3.6.3.</span> 活用のためのアイディア / 最終的には削除されてしまう部分が含まれていても良い</h4>
<div class="outline-text-4" id="text-3-6-3">
</div>
<div id="outline-container-org2720f37" class="outline-5">
<h5 id="org2720f37"><span class="section-number-5">3.6.3.1.</span> 考え方</h5>
<div class="outline-text-5" id="text-3-6-3-1">
<p>
メールの執筆やチケットの起票などにおいて、<br />
必須の要素を書き漏らさないように、<br />
観点を列挙しておくために定型句を貼り付け、<br />
記述が進むうちに、削除されてしまってもいい。<br />
</p>
</div>
</div>
<div id="outline-container-orgbbd0d09" class="outline-5">
<h5 id="orgbbd0d09"><span class="section-number-5">3.6.3.2.</span> 具体例</h5>
<div class="outline-text-5" id="text-3-6-3-2">
<ul class="org-ul">
<li>5W1H<br />
<ul class="org-ul">
<li>Who<br /></li>
<li>Where<br /></li>
<li>When<br /></li>
<li>What<br /></li>
<li>Why<br /></li>
<li>How<br /></li>
<li>How much<br /></li>
</ul></li>
<li>バグの報告（速報）<br />
<ul class="org-ul">
<li>環境<br />
<ul class="org-ul">
<li>開発? 検証? 本番?<br /></li>
<li>アプリのver（git の commit ID）<br /></li>
</ul></li>
<li>発生時刻<br /></li>
<li>発生手順<br /></li>
<li>現象<br /></li>
<li>影響範囲<br /></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org980884f" class="outline-4">
<h4 id="org980884f"><span class="section-number-4">3.6.4.</span> 活用のためのアイディア / まず登録するもの / 汎プロジェクト</h4>
<div class="outline-text-4" id="text-3-6-4">
<ul class="org-ul">
<li>部署名（詳細）<br /></li>
<li>部署名（簡略）<br /></li>
<li>メールアドレス<br /></li>
<li>メールの署名<br /></li>
<li>電話番号（私物）<br /></li>
<li>メールアドレス（私物）<br /></li>
<li>物品登録番号・バーコード番号・（固定IPアドレス）<br /></li>
<li>linuxコマンド<br />
<ul class="org-ul">
<li>git系<br /></li>
<li>apt系（ubuntu）<br /></li>
<li>docker, docker composer, kubernates<br /></li>
<li>find と xargs<br /></li>
<li>sed や awk<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6962eda" class="outline-4">
<h4 id="org6962eda"><span class="section-number-4">3.6.5.</span> 活用のためのアイディア / まず登録するもの / プロジェクト別</h4>
<div class="outline-text-4" id="text-3-6-5">
<ul class="org-ul">
<li>プロジェクトの情報<br />
<ul class="org-ul">
<li>プロジェクトのコードネーム<br /></li>
<li>登録番号（親番号）<br /></li>
<li>ファイル名の接頭辞「yyyymmdd_【コードネーム】__」<br /></li>
<li>AWSアカウントの情報<br />
<ul class="org-ul">
<li>ログインURL<br /></li>
<li>AWSアカウント番号<br /></li>
<li>AWSアカウントの別名（エイリアス）<br /></li>
</ul></li>
<li>Issue Tracking System<br />
<ul class="org-ul">
<li>チケット一覧のURL<br /></li>
<li>チケット一覧のURL（未完了のみ）<br /></li>
<li>チケット一覧のURL（自分が担当するもののみ）<br /></li>
</ul></li>
<li>お客様情報<br />
<ul class="org-ul">
<li>会社名<br /></li>
<li>部署名<br /></li>
<li>住所<br /></li>
<li>電話番号<br /></li>
</ul></li>
<li>メンバー名<br />
<ul class="org-ul">
<li>同音異字がある方<br /></li>
<li>同性の方がいる場合<br /></li>
<li>難読の名字の方<br /></li>
<li>外国籍の方（その方が望む、カタカナでの表記）<br /></li>
</ul></li>
<li>固有名詞<br />
<ul class="org-ul">
<li>法律名<br /></li>
<li>制度名<br /></li>
<li>組織名<br />
<ul class="org-ul">
<li>省庁名、部局名<br /></li>
<li>独立行政法人名<br /></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org466db98" class="outline-4">
<h4 id="org466db98"><span class="section-number-4">3.6.6.</span> 活用のためのアイディア / 日々更新（追加・変更）</h4>
<div class="outline-text-4" id="text-3-6-6">
<ul class="org-ul">
<li>設計の成果物（設計中でも）<br />
<ul class="org-ul">
<li>データベース名<br /></li>
<li>スキーマ名<br /></li>
<li>テーブル名<br /></li>
<li>文書名、ファイル名<br /></li>
<li>画面名<br /></li>
</ul></li>
<li>呼び出すAPIの属性<br />
<ul class="org-ul">
<li>エンドポイント（URL）<br /></li>
<li>パス<br /></li>
<li>query文字列<br /></li>
<li>httpのヘッダーやボディのkey名<br /></li>
<li>AWSリソース名<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org526a0a8" class="outline-4">
<h4 id="org526a0a8"><span class="section-number-4">3.6.7.</span> 活用のためのアイディア / 日々更新（追加・変更）が面倒？</h4>
<div class="outline-text-4" id="text-3-6-7">
<p>
Q. 面倒！<br />
</p>
</div>
<div id="outline-container-org46148b3" class="outline-5">
<h5 id="org46148b3"><span class="section-number-5">3.6.7.1.</span> A. 指数の力</h5>
<div class="outline-text-5" id="text-3-6-7-1">
<p>
道具（定型句）単品ではなく、複数の道具（定型句）を掛け合わせることによる複利的効果<br />
</p>
</div>
<div id="outline-container-orgbc54be1" class="outline-6">
<h6 id="orgbc54be1"><span class="section-number-6">3.6.7.1.1.</span> 指数とは？</h6>
<div class="outline-text-6" id="text-3-6-7-1-1">
<p>
累乗（るいじょう）とも言う。<br />
</p>
</div>
<div id="outline-container-orgdb38a5a" class="outline-7">
<h7 id="orgdb38a5a"><span class="section-number-7">3.6.7.1.1.1.</span> 数式の定義</h7>
<div class="outline-text-7" id="text-3-6-7-1-1-1">
<ul class="org-ul">
<li>2の3乗 = 2 ** 3 = 2 ^ 3 = 2 * 2 * 2 = 8<br /></li>
<li>3の4乗 = 3 ** 4 = 3 ^ 4 = 3 * 3 * 3 * 3 = 81<br /></li>
</ul>
</div>
</div>
