ClipboardHistory/published/20241127_ClipboardHistory.org
****** 複利的効果
- 1.070 ** 10 = 1.96 = 約2倍
  - 1.07 = +7%
  - 解釈 :: 生産性を 7% の向上させる仕組みや道具を10個導入すると、生産性は2倍になる。
  - 解釈 :: 年利 7% で再帰的に投資を続けると、10年には2倍になる。
- 1.002 ** 365 = 2.07 = 約2倍
  - 1.002 = +0.2%
  - 解釈 :: 毎日0.2% ずつ向上すると、1年後には能力が 2倍 になる。
    - 1.002 ** 250 = 約1.6
****** ■寄り道
- 英語で指数を POWER と言う。
  - 3の二乗 = 3 * 3 = 9
    - "the second power of 3"
    - "3 (raised) to the second power"
**** A. 面倒なのは、思い込みに過ぎない。
- 思い込みを打破するために、定量的に観測する
  - → タイマーで所要時間を計測する

| 洗濯物干し（一人暮らし、3日分）          | 8分       |
| バックランジ 20回×3セット（休憩1分30秒） | 7分～12分 |
| ジョギング（5周 with 30秒の休み）        | 12分      |
| 化粧水と乳液を塗り込む                   | 2分       |
| 爪にヤスリを掛ける（2日に1回）           | 5分       |

**** A. 業務なんだから、面倒かどうかに関係なくやる。
- Q2. 業務??? 定型句の登録はオプション（任意、ボランティア）では？
- A2-2. 目線（基準）を高く持て。
  - 『少年よ、大志を抱け この老人のように』
    - Boys, Be ambitious like this old man.
    - ウィリアム・スミス・クラーク
*** 活用のためのアイディア / どこでも（ポータビリティ）
便利なので、いつでもどこでも使いたい！

- 横浜オフィスだけでなく、
- 常駐先でも
- 自宅でも
- 南極でも
- 宇宙ステーションでも
- 火星でも

*GITHUB.COM* しか勝たん！

**** 注意

- github.comにアップロード（git の push）する前に、社外秘情報を削除すべし。
  - 最上層に"FSI層"（"FSIブロック"）を設けるべし。
  - FSI層の削除を自動化すべし
    - 「Git Hook」

*** 活用のためのアイディア / 虫食いでもいい。

**** 考え方
-  完成形を貼り付ける必要なない。部分的に修正を施してもいい。（前項と似ている。）
- ICT用語（IT用語）で言うと、Atomic性（原子性）を保証しなくてもいい。

**** 前提条件; ）僕の）ファイル名（の接頭辞）の命名規則
- 【日付】_【プロジェクトのコードネーム】_【チケット番号】_【短い説明文】.【拡張子】
- 例; 20241118_banana_1234_バグ発生時のDBのmem使用率.png
  - 【日付】=20241118
  - 【プロジェクトのコードネーム】=banana
  - 【チケット番号】=1234
  - 【短い説明文】=バグ発生時のDBのmem使用率
  - 【拡張子】=png
**** 具体例
上記の命名規則に対して、以下の定型句を使うと、間違い（規則からの逸脱）が減らせる。
- 「yyyymmdd_banana__」
  - 注意:末尾で、アンダースコア（アンダーバー）が2つ連即している。
