ClipboardHistory/published/20241127_ClipboardHistory.html
<div id="outline-container-org9614eda" class="outline-7">
<h7 id="org9614eda"><span class="section-number-7">3.6.7.1.1.2.</span> 複利的効果</h7>
<div class="outline-text-7" id="text-3-6-7-1-1-2">
<ul class="org-ul">
<li>1.070 ** 10 = 1.96 = 約2倍<br />
<ul class="org-ul">
<li>1.07 = +7%<br /></li>
<li id="解釈">生産性を 7% の向上させる仕組みや道具を10個導入すると、生産性は2倍になる。<br /></li>
<li id="解釈">年利 7% で再帰的に投資を続けると、10年には2倍になる。<br /></li>
</ul></li>
<li>1.002 ** 365 = 2.07 = 約2倍<br />
<ul class="org-ul">
<li>1.002 = +0.2%<br /></li>
<li id="解釈">毎日0.2% ずつ向上すると、1年後には能力が 2倍 になる。<br />
<ul class="org-ul">
<li>1.002 ** 250 = 約1.6<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga90853b" class="outline-7">
<h7 id="orga90853b"><span class="section-number-7">3.6.7.1.1.3.</span> ■寄り道</h7>
<div class="outline-text-7" id="text-3-6-7-1-1-3">
<ul class="org-ul">
<li>英語で指数を POWER と言う。<br />
<ul class="org-ul">
<li>3の二乗 = 3 * 3 = 9<br />
<ul class="org-ul">
<li>"the second power of 3"<br /></li>
<li>"3 (raised) to the second power"<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org570e565" class="outline-5">
<h5 id="org570e565"><span class="section-number-5">3.6.7.2.</span> A. 面倒なのは、思い込みに過ぎない。</h5>
<div class="outline-text-5" id="text-3-6-7-2">
<ul class="org-ul">
<li>思い込みを打破するために、定量的に観測する<br />
<ul class="org-ul">
<li>→ タイマーで所要時間を計測する<br /></li>
</ul></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">洗濯物干し（一人暮らし、3日分）</td>
<td class="org-left">8分</td>
</tr>

<tr>
<td class="org-left">バックランジ 20回×3セット（休憩1分30秒）</td>
<td class="org-left">7分～12分</td>
</tr>

<tr>
<td class="org-left">ジョギング（5周 with 30秒の休み）</td>
<td class="org-left">12分</td>
</tr>

<tr>
<td class="org-left">化粧水と乳液を塗り込む</td>
<td class="org-left">2分</td>
</tr>

<tr>
<td class="org-left">爪にヤスリを掛ける（2日に1回）</td>
<td class="org-left">5分</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga849285" class="outline-5">
<h5 id="orga849285"><span class="section-number-5">3.6.7.3.</span> A. 業務なんだから、面倒かどうかに関係なくやる。</h5>
<div class="outline-text-5" id="text-3-6-7-3">
<ul class="org-ul">
<li>Q2. 業務??? 定型句の登録はオプション（任意、ボランティア）では？<br /></li>
<li>A2-2. 目線（基準）を高く持て。<br />
<ul class="org-ul">
<li>『少年よ、大志を抱け この老人のように』<br />
<ul class="org-ul">
<li>Boys, Be ambitious like this old man.<br /></li>
<li>ウィリアム・スミス・クラーク<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgffd5a53" class="outline-4">
<h4 id="orgffd5a53"><span class="section-number-4">3.6.8.</span> 活用のためのアイディア / どこでも（ポータビリティ）</h4>
<div class="outline-text-4" id="text-3-6-8">
<p>
便利なので、いつでもどこでも使いたい！<br />
</p>

<ul class="org-ul">
<li>横浜オフィスだけでなく、<br /></li>
<li>常駐先でも<br /></li>
<li>自宅でも<br /></li>
<li>南極でも<br /></li>
<li>宇宙ステーションでも<br /></li>
<li>火星でも<br /></li>
</ul>

<p>
<b>GITHUB.COM</b> しか勝たん！<br />
</p>
</div>
<div id="outline-container-orgea905f4" class="outline-5">
<h5 id="orgea905f4"><span class="section-number-5">3.6.8.1.</span> 注意</h5>
<div class="outline-text-5" id="text-3-6-8-1">
<ul class="org-ul">
<li>github.comにアップロード（git の push）する前に、社外秘情報を削除すべし。<br />
<ul class="org-ul">
<li>最上層に"FSI層"（"FSIブロック"）を設けるべし。<br /></li>
<li>FSI層の削除を自動化すべし<br />
<ul class="org-ul">
<li>「Git Hook」<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbca2b62" class="outline-4">
<h4 id="orgbca2b62"><span class="section-number-4">3.6.9.</span> 活用のためのアイディア / 虫食いでもいい。</h4>
<div class="outline-text-4" id="text-3-6-9">
</div>
<div id="outline-container-org3cfe6cf" class="outline-5">
<h5 id="org3cfe6cf"><span class="section-number-5">3.6.9.1.</span> 考え方</h5>
<div class="outline-text-5" id="text-3-6-9-1">
<ul class="org-ul">
<li>完成形を貼り付ける必要なない。部分的に修正を施してもいい。（前項と似ている。）<br /></li>
<li>ICT用語（IT用語）で言うと、Atomic性（原子性）を保証しなくてもいい。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge390e2b" class="outline-5">
<h5 id="orge390e2b"><span class="section-number-5">3.6.9.2.</span> 前提条件; ）僕の）ファイル名（の接頭辞）の命名規則</h5>
<div class="outline-text-5" id="text-3-6-9-2">
<ul class="org-ul">
<li>【日付】_【プロジェクトのコードネーム】_【チケット番号】_【短い説明文】.【拡張子】<br /></li>
<li>例; 20241118_banana_1234_バグ発生時のDBのmem使用率.png<br />
<ul class="org-ul">
<li>【日付】=20241118<br /></li>
<li>【プロジェクトのコードネーム】=banana<br /></li>
<li>【チケット番号】=1234<br /></li>
<li>【短い説明文】=バグ発生時のDBのmem使用率<br /></li>
<li>【拡張子】=png<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3fc5f88" class="outline-5">
<h5 id="org3fc5f88"><span class="section-number-5">3.6.9.3.</span> 具体例</h5>
<div class="outline-text-5" id="text-3-6-9-3">
<p>
上記の命名規則に対して、以下の定型句を使うと、間違い（規則からの逸脱）が減らせる。<br />
</p>
<ul class="org-ul">
<li>「yyyymmdd_banana__」<br />
<ul class="org-ul">
<li>注意:末尾で、アンダースコア（アンダーバー）が2つ連即している。<br /></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
